Revit 2017 API
AssetPropertyReference Class
A reference property of material.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class AssetPropertyReference : AssetProperty
Visual Basic
Public Class AssetPropertyReference _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyReference : public AssetProperty
Remarks
It holds a reference to other property.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetPropertyReference
See Also
AssetPropertyReference Members
Autodesk.Revit.Utility Namespace